temp = int(input('Введите текущую температуру в комнате: '))
if temp > 19:
    print('Кондиционер выключен')
else:
    print('Кондиционер включен')

# Задание 1


